WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_d_c.c
    case 0x07:    // (illegal) Rising and Falling plus UIF
      // This case exists when the duty cycle is very small (< 0.5%) or very
      // large (> 99.5%)
      timStatusReg &= ~GTIM_SR_CC1IF;
      timStatusReg &= ~GTIM_SR_CC2IF;
      timStatusReg &= ~GTIM_SR_UIF;
      freqDcData->timerDectSync = MEADOW_TIMER_FREQ_DC_SYNC_ERROR;
      break;
  }

  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

  return OK;
}

//=============================================================
// Uses the bit-field to determine the Timer clock
uint32_t meadow_timer_get_max_clock(struct timerInfo_s *timerInfo)
{
  if(timerInfo->timerMaxClk)
    return STM32_APB2_TIM1_CLKIN;
  else
    return STM32_APB1_TIM2_CLKIN;
}

//=====================================================================
// From the timer number find the correct GPIO table entry
static struct timerGpio_s * meadow_timer_get_timer_gpio_pointer(int timerNumb)
{
  // Look through all the times and find the matching one 
  for (int offset = 0; offset < MEADOW_TIMER_TOTAL_NUMBER_AVAILABLE; offset++)
  {
    if(timerInfoArray[offset].timerNumb == timerNumb)
    {
      return ( &(timerGpioArray[offset]));
    }
  }

  return NULL;
}

//=====================================================================
// The following function finds the specified timer if one exists and
// returns a point information structure.
static struct timerInfo_s * meadow_timer_get_timer_info_pointer(int timerNumb)
{
  for (int offset = 0; offset < MEADOW_TIMER_TOTAL_NUMBER_AVAILABLE; offset++)
  {
    if(timerInfoArray[offset].timerNumb == timerNumb)
    {
      return ( &(timerInfoArray[offset]));
    }
  }

  return NULL;
}

//=============================================================
// Find the proper timer, version and channel for the GPIO Alt
// Function, Port and Pin for this timer.
uint32_t meadow_timer_get_ver_based_gpio_chan(int timerNumb,
          uint32_t pinDesignation)
{
  // Get the pointer to the master structure that contains all the GPIO
  // information.
  struct timerGpio_s *timerGpio = meadow_timer_get_timer_gpio_pointer(timerNumb);

  // Depending on the version look for the specific GPIO supplied to function
  if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V1)
  {
    for(uint32_t chan = 0; chan < MEADOW_TIMER_MAX_TIMER_CHANNELS; chan++)
    {
      if(timerGpio->timerF7v1Gpio[chan] == pinDesignation)
        return chan;
    }
    return MEADOW_TIMER_BAD_GPIO_VALUE;    // Not found
  }
  else if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V2 ||
          meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_CCMV2)
  {
    for(uint32_t chan = 0; chan < MEADOW_TIMER_MAX_TIMER_CHANNELS; chan++)
    {
      if(timerGpio->timerF7v2Gpio[chan] == pinDesignation)
        return chan;
    }
    return MEADOW_TIMER_BAD_GPIO_VALUE;    // Not found
  }
  else
  {
    return MEADOW_TIMER_BAD_GPIO_VALUE;   // Invalid version
  }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called by Meadow.Core to configure
// Timer numbers range from 1 - 14. However, some are not defined because they
// aren't available to Meadow.
int meadow_timer_freq_duty_config(uint32_t timerNumber, uint32_t gpioPort,
          uint32_t gpioPin, uint32_t gpioPolarity)
{
  int ret;
  struct freqDcData_s *freqDcData;
  uint8_t pinDesignation = gpioPort << 4 | gpioPin;

  // Check if there's already an object in this slot
  struct timerInfo_s *timerInfo = meadow_timer_get_timer_info_pointer(timerNumber);
  if(timerInfo != NULL)
  {
    syslog(LOG_ERR, "%s@%d-There is already a timer defined in slot.\n", __FILE__, __LINE__);
  }
  
  // Allocate a new struct for each timer desired
  freqDcData = zalloc(sizeof(struct freqDcData_s));
  if(freqDcData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Memory allocation returned NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }

  // Start populating timer information structure
  timerInfo->dataPtr = (void *) freqDcData;

  freqDcData->gpioInputConfig = pinDesignation;

  // Timers can have 1-4 channels connected to 1-4 GPIOs. For the specified
  // timer we need to verify a proper GPIO has been selected.
  uint32_t channelFound = meadow_timer_get_ver_based_gpio_chan(timerNumber, pinDesignation);
  if(channelFound == MEADOW_TIMER_BAD_GPIO_VALUE)
  {
    syslog(2, "The requested GPIO and Timer combination are not supported\n");
    freqDcData->gpioInputConfig = MEADOW_TIMER_BAD_GPIO_VALUE;
    return -ENOTSUP;
  }

  // Valid GPIO so configure it
  stm32_configgpio(freqDcData->gpioInputConfig);

  // Save the polarity
  freqDcData->inputPolarity = gpioPolarity;
    
  // Initialized the timer itself
  ret = meadow_timer_init_freq_and_dutycycle(timerNumber);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow freq + duty cycle init failed:%d\n", __FILE__, __LINE__, ret);
    return ret;
  }

  return OK;
}

//=============================================================
// Frequency and duty cycle measurement.
int meadow_timer_init_freq_and_dutycycle(int timerNumber)
{
  // See RM0410 Reference manual for STM32F76xxx and STM32F77xxx section 26.3.6
  // for original concept.

  // A single input (T1) is used. It is configured as input to Compare/Capture
  // registers 1 and 2. For CCR1 it is configured to for rising edge interrupt
  // and falling edge for ccr2. By using the count between interrupts for one
  // CCR's (i.e. rising to rising edges) the frequency can be found by counting
  // between interrupts from rising to falling the duty cycle can be found.

  int ret;
  uint16_t regVal16;
  uint32_t regVal32;

  struct timerInfo_s *timerInfo = meadow_timer_get_timer_info_pointer(timerNumber);

  // Has this slot already been taken?
  if(timerInfo->dataPtr != NULL)
  {
    syslog(LOG_ERR, "%s@%d-There is already a timer defined in slot.\n", __FILE__, __LINE__);
    return -ENOTEMPTY;
  }

  struct freqDcData_s *freqDcData = (struct freqDcData_s *)timerInfo->dataPtr;
  uint32_t timerBase = timerInfo->timerBase;

